IDENTIFICATION DIVISION.
PROGRAM-ID. ONE-DIMENSIONAL.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 COUNTS PIC 9(02) VALUE 0.
    01 MONTHS VALUE
        "JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC".
            05 MONTH OCCURS 12 TIMES PIC A(3).
PROCEDURE DIVISION.
    PERFORM VARYING COUNTS FROM 1 BY 1 UNTIL COUNTS=13
    DISPLAY "MONTHS VALUE:  " MONTH(COUNTS)
    END-PERFORM.
STOP RUN.