       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZ-BUZZ.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       STOP RUN.